diagram updates to try to get away from mermaid, since these frequently fail to generate on deploy
